sites/main/_posts/2010-11-10-surviving-openerp.html
---
tags: openerp
title: Surviving OpenERP
published: false
---

<div id="outline-container-sec-1" class="outline-3">
<h3 id="sec-1">Discuss usecase for mailgate</h3>
<div class="outline-text-3" id="text-1">
<p>
List of immediate apparent problems which make usage problematic:
</p>
<ul class="org-ul">
<li>no comment in the while file at all
</li>
<li><code>case_description</code> is never expanded (always <code>False</code>)
</li>
<li>there is no ordering in the crm rules, this makes it unsuitable for
anything but the simplest, based on the fields in the form only
</li>
<li>the mail body configured is a clear candidate for multiple languages
(this would have been no extra trouble during implementation) so the
mail message sent out can be in the customers language (CRM is about
customers aint it?)
</li>
<li>the body is not set properly by mailgate (if this code is used
anywhere, someone would have noticed)
</li>
<li>port number for mailgate is needed, if there is a multiple app
hosting server out there, it needs it.
</li>
<li>canal on mailgate could be set automatically as the channel is by
defintion email. This saves time and improves accuracy of the
mailgate script.
</li>
<li></li>
</ul>
</div>
</div>
